START_GREETING = 'Приветствую в боте класса 7И! Тут вы можете получить информацию об текущих уроках а также информацию о классе.'
INFO_BOT = 'Класс 7И - это класс профиля IT-Вертикаль с уклоном на IT соотвественно.\nПо вопросом о боте можете обратится ко мне.'
ERROR_LESSON_NOT_FOUND = 'Уроки не были найдены или произошла ошибка. Обратитесь к администратору.'

DAY_MAPPING_CORRECTED = {
    'monday': 'понедельник',
    'tuesday': 'вторник',
    'wednesday': 'среду',
    'thursday': 'четверг',
    'friday': 'пятницу',
    'saturday': 'субботу',
    'sunday': 'воскресенье'
}
PEOPLE_WHOSE_IS_NO = 'Напишите имя и фамилию человека который отсутсвует.'